Repository: prashant-v-53/Way-2-work
Catalog: lib/l10n/intl_*.arb
Languages: et, fi

# tACPoint1
source: 1. The Provision of Services 1.1. The Contractor will perform the Services for the Principal as specified in Annex I (and any subsequent Annexes entered into between the Principal and the Contractor that supplement and form a part of this Agreement from time to time) and subject to the terms of this Agreement. The Contractor will use its reasonable endeavours to comply with any timetable or other targets for progress or delivery or completion of the Services as agreed in writing between the Princiapl and the Contractor. 1.2. The Contractor will ensure that in provision of the Services the Contractor complies with all applicable laws, rules and regulations relevant to the provision of the Services (including without limitation, rules and regulations in respect of statutory obligations, data protection legislation, health and safety, and security). 1.3 The Contractor shall comply with all reasonable standards of safety and the Principal’s health and safety procedures from time to time in force and report to the Principal any unsafe working conditions or practices. 1.4 The Contractor shall comply with the Principal’s policies on social media, confidentiality, security, use of information and communication systems, anti- harassment and bullying, code of conduct and any other policy applicable to contractors published by the Principal from time to time. 1.5 The Contractor will provide the Services with all due care, diligence and professional skill and comply and co-operate with any quality control procedures that are notified to the Contractor by the Principal. 1.6 Any incorrect or defective work arising as a result of the Services shall be remedied by the Contractor in the Contractor’s own time and at the Contractor’s own cost. 1.7 The Services will be provided at the site(s) specified from time to time by the Principal. 1.8 The Principal will provide for the use of the Contractor any such equipment as may reasonably be required for performing the Services, including (where necessary) adequate computer, voice and data technology and a suitable car (adequately insured for business use). It is the Principal’s responsibility to adequately insure any such equipment as appropriate. 1.9 The Contractor shall not be required to provide any advice and assistance outside the scope of the Services. 1.10 Save to the extent required by the Principal, and subject to arrangements for meetings and liaison, the Contractor will determine the time and place at which to carry out the Services and save as set out in this Agreement neither it nor its Contractor Representatives will be subject to control either by the Principal as to the nature, place, time or manner in which the Services are to be provided. 1.11 The Contractor will comply with the EU Working Time Directive 2003 as implemented in the EU Member State in which the Assignment is carried out by the Contractor engaged on the Services. The Contractor may take holiday at a reasonable time on prior notice. For the avoidance of doubt, the Principal shall have no responsibility in respect of holiday pay for any Contractor. 1.12 The Contractor shall: (a) comply with all applicable laws, regulations, codes and sanctions relating to anti-bribery and anti-corruption including but not limited to all applicable anti- money laundering, bribery and anti-corruption legislation; (b) comply with any and all ethics, anti-bribery and anti-corruption policies published by the Principal; (e) promptly report to the Principal any request or demand for any undue financial or other advantage of any kind received by the Contractor in connection with the performance of the Services; 1.13 Failure to comply with clause 1.12 will result in the termination of this Agreement without notice. 2. Payment 2.1. Subject to satisfactory performance of the Services, the Principal agrees to pay the Contractor for the Services in accordance with the Schedule and the rates specified in the relevant Annex. Payments will be made monthly in arrears to the Contractor within 7 days of receipt by the Principal of a valid and accurate invoice supported by work progress/timesheets (or, where applicable, project reports detailing the work performed together with an analysis of hours spent), signed by the Contractor. 2.2. Payments made will relate to days or proportions of days for which the Services have actually been provided only and no payment will be made by the Principal unless supported by a work progress/timesheet properly completed as instructed by the Principal’s representative and duly approved by such the Principal representative. It is the Contractor’s obligation to procure the approval of and the production to the Principal of work progress/timesheets. 3. Expenses 3.1. The Principal will not reimburse the Contractor for any expenses incurred unless otherwise stated in the Schedule. 4. Duration and Termination 4.1. This Agreement shall remain in force until all Assignments are completed as defined in the relevant Annexes, unless terminated earlier in accordance with the terms of this Agreement or extended by the agreement between the Principal and the Contractor. 4.2. Without prejudice to any other rights and remedies to which the Principal may be entitled under this Agreement, the Principal may terminate this Agreement with immediate effect without notice and without any liability to make any further payment to the Contractor (other than in respect of amounts accrued before the date of such termination) if at any time: 4.2.1 the Contractor commits any serious or repeated breach or non-observance of any of the provisions of this agreement or refuses or neglects to comply with any reasonable and lawful directions of the Principal; 4.2.2 the Contractor is convicted of any criminal offence (other than an offence under any road traffic legislation for which a fine or non-custodial penalty is imposed); 4.2.3 the Contractor is in the reasonable opinion of the Principal negligent or incompetent in the performance of the Services; 4.2.4 the Contractor becomes bankrupt or makes a voluntary arrangement with his or her creditors; 4.2.5 the Contractor commits any fraud or dishonesty or acts in any manner which in the opinion of the Principal brings or is capable of bringing the Contractor or the Principal into disrepute or is materially adverse to the interests of the Principal; 4.2.6 the Contractor commits any serious breach of the Principal’s policies and procedures; or 4.2.8 The Contractor wilfully or negligently introduces a virus or other harmful code to the Contractor’s or the Principal’s hardware or software used in the performance of the Services. 4.3. At any time during this Agreement and, in any event, upon termination of this Agreement, for whatever reason: 4.3.1 the Principal will be entitled to a copy of all work carried out or completed by the Contractor in the performance of the Services under this Agreement in the form in which it exists at the time; and 4.3.2 The Contractor will return to the Principal all equipment, documentation or other property in the Contractor’s possession or under his control belonging to the Principal. 4.4. The Principal may, with the agreement of the Contractor, extend the terms of the Agreement for a period agreed between the parties. 5. Intellectual Property 5.1. All rights, title and interest of whatever nature (including but not limited to copyright, designs and patent application rights) in any work undertaken or material produced by the Contractor in the course of the Services (the “Project Materials”) will vest in and belong to the Principal at all times, and free from any interest of the Contractor, the Contractor Representative or any third party. The Contractor will do anything that the Principal may reasonably require in order to effectively vest such rights in the Principal or such third party as the Principal specifies or to evidence the same (whether before or after the termination of this Agreement). 5.2. The Principal shall retain ownership of all intellectual property rights of whatever nature and, if registerable, whether registered or not, in the document or other material and data and other information provided to the Contractor in the context of this Agreement. 5.3. The Contractor will promptly disclose to the Principal any idea, method, invention, discovery, design, concept or other work made or created by the Contractor in the course of the Services. 5.4. The Contractor warrants that Services provided are not in breach of the intellectual property rights of any other third party, and will indemnify the Principal against all and any actions, claims, costs, expenses, damages, demands and liabilities whatsoever and howsoever incurred resulting from or arising out of any claim by a third party that the use of or possession of any work performed by or delivered by the Contractor in connection with this Agreement infringes the intellectual property rights of that third party, save that this will not apply where the infringement results directly from the compliance with any specifications issued by the Principal. 5.5 The Contractor hereby unconditionally, irrevocably and in perpetuity waives all moral rights and all rights of a similar nature under the laws of any jurisdiction in respect of the Project Materials. 5.6 The provisions of this paragraph 5 shall survive the expiration or termination of this Agreement, howsoever arising. 6. Force Majeure 6.1. Neither party shall have any liability to the other for delay or loss occasioned by any circumstance which is outside that party’s reasonable control to prevent (including but not limited to war, industrial dispute, fire, explosion, natural disaster, death). 7. Other Activities 7.1. Nothing in this Agreement shall prevent the Contractor from being engaged, concerned or having any financial interest in any capacity in any other business, trade, profession or occupation during the term of this Agreement and thereafter from the termination of this Agreement provided that such activity does not cause a breach of any of the Contractor's obligations under this Agreement (and in particular the obligations under clause 8). 8. Confidentiality 8.1 The term 'Confidential Information' shall mean any and all materials and information, disclosed by or otherwise obtained from the Principal or any third party as a result of this Agreement, whether written or oral, including, but not limited to: 8.1.1 technical, financial, commercial or other information which relates to the business, financial affairs, methods of operation or proposed methods of operation, accounts, transactions or products, proposed transactions or proposed products, security procedures, trade secrets, know-how, inventions, internal controls or computer or data processing programs, algorithms, electronic data processing applications, routines, subroutines, techniques or systems of the Principal or of any third party or their affiliates, customers, clients, agents, subcontractors; 8.1.2 information or data relating to the Principal or any third party’s systems, operations, policies, procedures, techniques, business plans, accounts or personnel; 8.1.3 the identities and other related information of the Principal’s and any third party’s suppliers and clients; 8.2 Notwithstanding the foregoing, 'Confidential Information' shall not include any information that: 8.2.1 becomes generally available to the public through no act or default on the part of the Contractor; 8.2.2 was already available to the Contractor without restriction in relation to disclosure before the date of receipt of the Confidential Information from the Principal or any third party. 8.3 The Contractor agrees: 8.3.1 to employ all reasonable measures to protect the Confidential Information from unauthorized or inadvertent disclosure, including measures no less protective than those measures that it employs to protect its own information of a like nature; 8.3.2 not to publish or disclose the fact that the Confidential Information has been made available or that it has entered into an arrangement regarding the subject matter hereof; 8.3.3 to restrict internal access to the Confidential Information to those employees and non-employee consultants with a 'need to know', who are either subject to a non-disclosure policy established by the Principal as their employer or have executed a non-disclosure agreement reasonably designed to maintain the confidentiality of the Confidential Information; 8.3.4 to be responsible for any breach of this Agreement by its employees, non- employee consultants or agents; 8.3.5 that notwithstanding the return of any Confidential Information in accordance with this paragraph 8, it shall, and shall ensure that its employees, non- employee consultants and agents continue to hold in confidence all Confidential Information, which obligation shall survive any expiration or termination of this Agreement; 8.3.6 that the Principal shall have the right to such injunctive or other equitable relief from a court of competent jurisdiction as may be necessary or appropriate to prevent any use or disclosure of Confidential Information in any manner which has not been authorized by the Principal or any third party without the necessity of proving actual damages, in addition to, and independent of, any damages which the Principal or any third party shall have incurred as a result of the breach; and 8.3.7 that upon request by the Principal at any time, the Contractor shall promptly either deliver all Confidential Information in tangible form then in its possession or under its control to the Principal or, if so directed by the Principal, confirm in writing to the Principal that all such Confidential Information has been destroyed. 8.4 If the Contractor is requested or required (by oral questions, interrogatories, requests for information or documents, subpoena, civil investigative demand or similar process) to disclose any Confidential Information, it is agreed that they shall, to the extent permitted by law, provide the Principal with prompt notice of such request(s) or obligation so that it may seek an appropriate protective order and/or waive compliance with the provisions of this Agreement. 8.5 The obligations imposed by this paragraph 8 shall survive any expiration or termination of this Agreement. 9. Mutuality of Obligation 9.1. Neither the Principal nor the Contractor is obliged to provide future work or services following completion of the Services or termination of this Agreement howsoever caused. 10. Light Entrepreneurship 10.1. This Agreement with the Principal is entered into by the Contractor as a light entrepreneur. For the avoidance of doubt, the Contractor is acting in connection with this Agreement as an independent consultant. The Contractor is not and will not be an employee or agent of the Principal and the Contractor assumes full responsibility for the Contractor’s acts and omissions. 11. Indemnity 11.1. The Contractor shall indemnify and keep indemnified the Principal, its directors, employees and agents against all and any actions, claims, costs, expenses, damages and liabilities whatsoever and howsoever incurred resulting or arising from any negligent, wrongful or unlawful act or omission of the Contractor. 11.2 Without limitation to the foregoing the Contractor hereby undertakes to indemnify the Principal and to keep it indemnified against any damage, demand, loss, expense, claim, action, or liability arising out of any breach by the Contractor of this Agreement. 12. Liability 12.1. In no circumstances will either party be liable to the other for any indirect, special or consequential loss or damage arising out of or in connection with this Agreement. In particular, and without limitation to the aforegoing, neither party will be liable for any loss by the other of business, revenue, profits, anticipated savings and goodwill save where such loss arises as a result of a breach of this Agreement. 12.2. Neither party excludes or limits liability for death or personal injury, to the extent only that the same arises as a result of its negligence or that of its employees, agents or authorised representatives. 13. VAT 13.1. All sums payable by the Principal to the Contractor shall, unless otherwise agreed, be exclusive of Value Added Tax for which the Contractor will be responsible and which shall be charged in addition to the rate in effect on the date of the invoice. 14. Publicity 14.1. The Contractor shall not make any public disclosures relating to this Agreement or the subject matter of this Agreement except for the purposes of this Agreement and as agreed by the Principal, or for any disclosure required by law. 15. Insurance 15.1 It is a condition of this Agreement that the Contractor will maintain professional indemnity insurance for an amount not less than £1 million and employer’s liability and public liability insurance for a total amount of not less than £1 million for the entire duration of this Agreement (including any agreed extension) and shall produce copies of each such policy within 7 days of a request by the Principal. 17. Severability 17.1 In the event that any provision or part thereof of this Agreement is held to be invalid or unenforceable, the remaining provisions and parts of this Agreement shall remain in full force and in effect. 18. Waiver 18.1 The waiver by either party of any default or breach of this Agreement shall not constitute a waiver of any other or subsequent default or breach. 19. Entire Agreement 19.1 This Agreement cannot be modified or amended except by agreement between the parties, which must be in writing and signed by each party. 20. Construction 20.1 Headings have been included for convenience only and shall not be used in constructing any provision of this Agreement. 21. Governing Law 21.1 This Agreement shall be governed by and interpreted in accordance with Finnish Law. The parties agree to submit to the exclusive jurisdiction of the courts of Finland.
et: 1. Palvelujen tarjoaminen 1.1 Toimeksisaaja tarjoaa toimeksiantajalle palveluja, jotka on täsmennetty liitteessä I (ja mahdollisissa toimeksiantajan ja toimeksisaajan kesken myöhemmin tehtävissä liitteissä, jotka täydentävät ajoittain tätä sopimusta ja muodostavat sen osan) ja jotka ovat tämän sopimuksen ehtojen kohteena. Toimeksisaaja käyttää kohtuullisia keinoja noudattaakseen kaikkia aikatauluja tai muita tavoitteita toimeksiantajan ja toimeksisaajan kesken kirjallisesti sovittujen palvelujen etenemistä, toimittamista tai loppuun saattamista varten. 1.2 Toimeksisaaja varmistaa, että hän noudattaa palveluja tarjotessaan kaikkia palvelujen tarjoamisen kannalta merkityksellisiä sovellettavia lakeja, asetuksia ja määräyksiä (mukaan lukien mutta ei ainoastaan lakisääteisiä velvoitteita sekä tietosuojaa, terveyttä ja turvallisuutta koskevia säädöksiä). 1.3 Toimeksisaaja noudattaa kaikkia kohtuullisia turvallisuusstandardeja sekä toimeksiantajan kulloinkin voimassa olevia terveys- ja turvallisuusmenettelyjä sekä raportoi toimeksiantajalle kaikista epäturvallisista työskentelyoloista ja -käytänteistä. 1.4 Toimeksisaaja noudattaa toimeksiantajan käytänteitä, jotka koskevat sosiaalisen median käyttöä, luottamuksellisuutta, turvallisuutta, tietojenkäsittely- ja tietoliikennejärjestelmien käyttöä, syrjinnän ja kiusaamisen ehkäisyä, menettelysääntöjä sekä kaikkia muita toimeksiantajan silloin tällöin julkaisemia käytänteitä, jotka koskevat urakoitsijoita. 1.5 Toimeksisaaja tarjoaa palveluja huolellisesti ja ammattitaitoisesti sekä myötävaikuttaa kaikkiin laadunvarmistustoimenpiteisiin, joista toimeksiantaja ilmoittaa toimeksisaajalle. 1.6 Minkä tahansa palvelujen tuloksena syntyneen virheellisen tai viallisen työsuorituksen toimeksisaaja korjaa omalla ajalla ja kustannuksella. 1.7 Palveluja tarjotaan toimeksiantajan silloin tällöin täsmentämillä työmailla. 1.8 Toimeksiantaja antaa toimeksisaajan käyttöön laitteet, joita voidaan kohtuullisesti tarvita palvelujen tarjoamiseen, muun muassa (tarvittaessa) asianmukaisen tietokoneen, ääni- ja datatekniikan ja sopivan auton (yrityskäyttöön asianmukaisesti vakuutettuna). Sellaisten laitteiden asianmukainen vakuuttaminen on toimeksiantajan vastuulla. 1.9 Toimeksisaajalta ei vaadita palvelujen ulkopuolelle jäävän neuvon ja avun antamista. 1.10 Paitsi siinä määrin kuin toimeksiantaja vaatii sekä kokousten ja yhteydenpidon järjestäminen pakottaa, toimeksisaaja määrää palvelujen tarjoamisen ajan ja paikan, ja tässä sopimuksessa säädettyä lukuun ottamatta toimeksisaaja ja toimeksisaajan edustajat eivät toimi toimeksiantajan valvonnassa palvelujen tarjoamisen luonteen, paikan, ajan tai tavan osalta. 1.11 Toimeksisaaja noudattaa EU:n työaikadirektiiviä 2003 sellaisena kuin sitä sovelletaan EU:n jäsenmaassa, jossa palveluja tarjoava toimeksisaaja suorittaa toimeksiantoa. Toimeksisaaja voi ottaa loman ilmoittamalla siitä kohtuullisessa ajassa etukäteen. Selvyyden vuoksi mainittakoon, että toimeksiantaja ei ole vastuussa lomarahojen maksamisesta kenelle tahansa toimeksisaajalle. 1.12 Toimeksisaaja: (a) noudattaa kaikkia sovellettavia lahjonnan ja korruption vastaisia lakeja, määräyksiä, säännöstöjä ja seuraamuksia, mukaan lukien mutta ei ainoastaan kaikkia sovellettavia rahanpesun, lahjonnan ja korruption vastaisia säädöksiä; (b) noudattaa kaikkia toimeksiantajan julkaisemia eettisiä sekä lahjonnan ja korruption vastaisia käytänteitä; (e) raportoi välittömästi toimeksiantajalle mistä tahansa aiheettoman taloudellisen tai muun edun pyynnöstä tai vaatimuksesta, jonka toimeksisaaja on saanut palvelujen tarjoamisen yhteydessä. 1.13 Kohdan 1.12 noudattamatta jättäminen johtaa tämän sopimuksen välittömään päättymiseen ilman irtisanomisaikaa. 2. Maksaminen 2.1 Työsuorituksen ollessa tyydyttävä toimeksiantaja suostuu maksamaan palveluista toimeksisaajalle asianmukaisessa liitteessä täsmennetyn aikataulun ja hinnaston mukaan. Toimeksiantaja suorittaa maksut toimeksisaajalle kuukausittain jälkikäteen 7 päivän kuluessa saatuaan toimeksisaajan allekirjoittaman pätevän ja täsmällisen laskun, jota tukevat työaikalomakkeet (tai tarvittaessa projektiraportit, joissa on esitetty yksityiskohtaisesti työsuoritus ja eritelty käytetty tuntimäärä). 2.2 Suoritetut maksut liittyvät vain sellaisiin päiviin tai sellaisten päivien osuuteen, jolloin palveluja on todella tarjottu, ja toimeksiantaja ei suorita mitään maksua, ellei laskua tue toimeksiantajan edustajan ohjeiden mukaan oikein täytetty ja toimeksiantajan edustajan asianmukaisesti hyväksymä työaikalomake. Työaikalomakkeiden hankkiminen toimeksiantajalta ja hyväksyttäminen toimeksiantajalla on toimeksisaajan velvollisuus. 3. Kulut 3.1 Toimeksiantaja ei korvaa toimeksisaajalle mitään koituneita kuluja, ellei aikataulussa toisin mainita. 4. Voimassaoloaika ja päättyminen 4.1 Tämä sopimus jää voimaan, kunnes kaikki toimeksiannot on suoritettu asianmukaisissa liitteissä määritellyllä tavalla, ellei sitä sanota irti aikaisemmin tämän sopimuksen ehtojen mukaan tai jatketa toimeksiantajan ja toimeksisaajan välisellä sopimuksella. 4.2 Rajoittamatta muiden oikeuksien tai keinojen soveltamista, joihin toimeksiantaja voi olla oikeutettu tämän sopimuksen mukaan, toimeksiantaja voi päättää tämän sopimuksen ilman irtisanomista ja välittömin vaikutuksin ja ilman velvollisuutta suorittaa toimeksisaajalle lisää maksuja (muita kuin ennen sellaisen päättämisen päivämäärää kertyneitä rahamääriä), jos milloin tahansa: 4.2.1 toimeksisaaja rikkoo tai jättää noudattamatta vakavasti tai toistuvasti minkä tahansa tämän sopimuksen säännöksen tai kieltäytyy noudattamasta mitä tahansa toimeksiantajan kohtuullisia ja laillisia ohjeita tai lyö sellaiset ohjeet laimin; 4.2.2 toimeksisaaja syyllistyy mihin tahansa rikokseen (lukuun ottamatta tieliikennerikkomusta, josta seuraa sakko tai vankeusrangaistukselle vaihtoehtoinen seuraamus); 4.2.3 toimeksisaaja on toimeksiantajan kohtuullisen lausunnon mukaan palveluja tarjotessaan huolimaton tai epäpätevä; 4.2.4 toimeksisaaja ajautuu konkurssiin tai hakeutuu vapaaehtoiseen velkajärjestelyyn; 4.2.5 toimeksisaaja syyllistyy petokseen tai epärehellisyyteen tai toimii millä tahansa tavalla, joka toimeksiantajan mielestä saattaa tai voi saattaa toimeksisaajan tai toimeksiantajan huonoon maineeseen tai loukkaa toimeksiantajan varallisia etuja; 4.2.6 toimeksisaaja rikkoo vakavasti toimeksiantajan käytänteitä ja menettelytapoja; taikka 4.2.8 toimeksisaaja päästää tahallaan tai tuottamuksesta viruksen tai muun haitallisen koodin toimeksisaajan tai toimeksiantajan laitteistoon tai ohjelmistoon, jota käytetään palvelujen tarjoamisessa. 4.3 Milloin tahansa tämän sopimuksen voimassaoloaikana ja joka tapauksessa tämän sopimuksen päättyessä mistä tahansa syystä: 4.3.1 toimeksiantajalla on oikeus saada kopio koko toimeksisaajan tekemästä tai loppuun suorittamasta työstä, joka liittyy tämän sopimuksen mukaisten palvelujen tarjoamiseen, sellaisessa muodossa, jossa se kulloinkin on; sekä 4.3.2 toimeksisaaja palauttaa toimeksiantajalle kaikki laitteet, asiakirjat ja muun toimeksisaajan hallussa olevan toimeksiantajalle kuuluvan omaisuuden. 4.4 Toimeksiantaja voi toimeksisaajan kanssa tekemällään sopimuksella jatkaa sopimuksen voimassaoloaikaa osapuolten kesken sovituksi ajaksi. 5. Immateriaaliomaisuus 5.1 Kaikki immateriaalioikeudet riippumatta niiden luonteesta (mukaan lukien mutta ei ainoastaan tekijän-, malli- ja patenttioikeudet), jotka koskevat mitä tahansa toimeksisaajan palvelujen tarjoamisen aikana tekemää työtä tai tuottamaa aineistoa (”projektiaineisto”), kuuluvat aina toimeksiantajalle ja ovat vapaita mistä tahansa toimeksisaajan, toimeksisaajan edustajan tai kolmannen osapuolen eduista. Toimeksisaaja tekee kaiken mitä toimeksiantaja voi vaatia kohtuudella valvoakseen sellaisten oikeuksien kuulumista toimeksiantajalle tai toimeksiantajan täsmentämälle kolmannelle osapuolelle tai todistaakseen samaa (joko ennen tämän sopimuksen päättymistä tai sen jälkeen). 5.2 Toimeksiantaja säilyttää kaikkien immateriaalioikeuksien omistuksen riippumatta niiden luonteesta ja hänen omistukseensa jäävät – jos rekisteröitävissä, joko rekisteröity tai ei – toimeksisaajalle tämän sopimuksen yhteydessä annetut asiakirjat tai muu aineisto, data ja muut tiedot. 5.3 Toimeksisaaja paljastaa välittömästi toimeksiantajalle kaikki ideat, menetelmät, keksinnöt, löydöt, mallit, konseptit tai muut työsuoritukset, jotka toimeksisaaja on tehnyt tai luonut palvelujen tarjoamisen aikana. 5.4. Toimeksisaaja takaa, että tarjotut palvelut eivät loukkaa kenenkään kolmannen osapuolen immateriaalioikeuksia, ja korvaa toimeksiantajalle kaikki toimenpiteet, vaatimukset, kulut, kustannukset, vahingot, pyynnöt ja vastuut, jotka aiheutuvat tai ovat seurausta mistä tahansa kolmannen osapuolen väitteestä, että toimeksisaajan tähän sopimukseen liittyvän työsuorituksen tai hänen toimittamansa sisällön käyttö tai hallussapito loukkaa kyseisen kolmannen osapuolen immateriaalioikeuksia, paitsi jos sellainen loukkaaminen johtuu suoraan toimeksiantajan antamien tietojen noudattamisesta. 5.5 Täten toimeksisaaja luopuu ehdottomasti, peruuttamattomasti ja ikuisesti kaikista moraalisista ja muista samanluonteisista oikeuksista projektiaineistoon kaikkien maiden lakien mukaan. 5.6 Kohdan 5 säännökset ovat voimassa myös tämän sopimuksen päättymisen tai irtisanomisen jälkeen. 6. Ylivoimainen este 6.1 Kumpikaan osapuoli ei ole vastuussa toiselle osapuolelle viivästyksestä tai katoamisesta, joka aiheutuu sellaisesta olosuhteesta, jota hän ei pysty kohtuullisilla ponnistuksilla hallitsemaan tai estämään (mukaan lukien mutta ei ainoastaan sota, työmarkkinakiista, tulipalo, räjähdys, luonnonkatastrofi, kuolema). 7. Muu toiminta 7.1 Mikään tässä sopimuksessa ei estä toimeksisaajaa olemasta asianosaisena tai omistamasta kuinka tahansa suurta taloudellista etua missä tahansa muussa liiketoiminnassa, kaupassa, ammatissa tai toimessa tämän sopimuksen voimassaoloaikana ja tämän sopimuksen päättymisen jälkeen, mikäli sellainen toiminta ei aiheuta toimeksisaajan tämän sopimuksen mukaisten (etenkin kohdassa 8 tarkoitettujen) velvollisuuksien laiminlyöntiä. 8. Luottamuksellisuus 8.1 Termi ”luottamuksellinen tieto” tarkoittaa kaikkia tämän sopimuksen tuloksena toimeksiantajan tai kolmannen osapuolen paljastamia tai muulla tavoin häneltä saatuja aineistoja ja tietoja, sekä kirjallisia että suullisia, mukaan lukien mutta ei ainoastaan seuraavia: 8.1.1 tekninen, taloudellinen, kaupallinen tai muu tieto, joka koskee toimeksiantajan tai kolmannen osapuolen tai heidän tytäryhtiöidensä, asiakkaidensa, edustajiensa, alihankkijoidensa liiketoimintaa, rahoitusasioita, toimintatapoja tai ehdotettuja toimintatapoja, tilejä, tilitapahtumia tai tuotteita, ehdotettuja tilitapahtumia tai ehdotettuja tuotteita, turvamenettelyjä, liikesalaisuuksia, osaamista, keksintöjä, sisäisiä tarkastuksia tai tietokone- tai tietojenkäsittelyohjelmia, algoritmeja, sähköisiä tietojenkäsittelysovelluksia, rutiineja, alirutiineja, tekniikoita tai järjestelmiä 8.1.2 tieto tai data, joka liittyy toimeksiantajan tai kolmannen osapuolen järjestelmiin, toimintaan, käytänteisiin, menettelytapoihin, tekniikkoihin, liiketoimintasuunnitelmiin, tileihin tai henkilöstöön 8.1.3 tunniste- ja muut vastaavat tiedot toimeksiantajan tai kolmannen osapuolen tavarantoimittajista ja asiakkaista. 8.2 Edellä olevan estämättä ”luottamuksellisena tietona” ei pidetä tietoa, joka: 8.2.1 tulee yleisesti yleisön saataville ilman toimeksisaajan tekoa tai oletusarvoisesti 8.2.2 oli jo ennen luottamuksellisen tiedon saantia toimeksiantajalta tai kolmannelta osapuolelta toimeksisaajan käytettävissä ilman paljastamista koskevia rajoituksia. 8.3 Toimeksisaaja suostuu: 8.3.1 toteuttamaan kaikki kohtuulliset toimenpiteet luottamuksellisen tiedon suojaamiseksi luvattomalta tai tahattomalta paljastamiselta, muun muassa sellaiset, jotka suojaavat tietoa vähintään yhtä tehokkaasti kuin toimenpiteet, joilla hän suojaa samanluonteisia omia tietojaan 8.3.2 olemaan julkistamatta tai paljastamatta tosiasiaa, että luottamuksellinen tieto on saatettu saataville tai että hän on tehnyt kyseistä aihetta koskevan sopimuksen 8.3.3 sallimaan yrityksen sisäisen pääsyn luottamukselliseen tietoon vain sellaisille työntekijöille ja ulkopuolisille konsulteille, joiden ”pitää tietää” se ja jotka ovat joko sellaisten salassapitokäytänteiden asianosaisia, jotka toimeksiantaja on ottanut käyttöön heidän työnantajanaan, tai ovat tehneet kohtuullisen salassapitosopimuksen, jonka nojalla voidaan pitää luottamukselliset tiedot salassa 8.3.4 olemaan vastuussa mistä tahansa tämän sopimuksen rikkomisesta työntekijöidensä, ulkopuolisten konsulttiensa tai edustajiensa toimesta 8.3.5 siihen, että luottamuksellisen tiedon palauttamisesta huolimatta tämän kohdan 8 mukaan hän pitää jatkuvasti salassa kaikki luottamukselliset tiedot ja varmistaa, että sitä tekevät myös hänen työntekijänsä, ulkopuoliset konsulttinsa ja edustajansa, mikä velvollisuus pysyy myös tämän sopimuksen päättymisen tai irtisanomisen jälkeen 8.3.6 siihen, että toimeksiantajalla on oikeus sellaiseen toimivaltaisen tuomioistuimen kieltotuomioon tai muuhun vastaavaan määräykseen, joka voi olla välttämätön tai asianmukainen ehkäisemään mitä tahansa luottamuksellisen tiedon käyttöä tai paljastamista millä tahansa tavalla, jota toimeksiantaja tai kolmas osapuoli ei ole sallinut, ilman tarvetta näyttää toteen todelliset vahingot sellaisten vahinkojen lisäksi ja riippumatta sellaisista vahingoista, jotka toimeksiantaja tai kolmas osapuoli on aiheuttanut rikkomisen tuloksena; sekä 8.3.7 siihen, että toimeksiantajan pyynnöstä milloin tahansa toimeksisaaja viipymättä joko toimittaa toimeksiantajalle kaikki aineellisessa muodossa olevat luottamukselliset tiedot, jotka ovat hänen hallussaan tai hallinnassaan, tai toimeksiantajan näin määrätessä vakuuttaa kirjallisesti toimeksiantajalle, että kaikki sellaiset luottamukselliset tiedot on hävitetty. 8.4 Jos toimeksisaajaa pyydetään tai vaaditaan (suullisella kysymyksellä, kuulustelulla, tieto- tai asiakirjojapyynnöllä, haasteella, siviilioikeudellisella tutkintavaatimuksella tai muulla vastaavalla menettelyllä) paljastamaan mitä tahansa luottamuksellista tietoa, on sovittu, että hänen tulee lain sallimassa laajuudessa ilmoittaa viipymättä toimeksiantajalle sellaisesta pyynnöstä tai velvollisuudesta, jotta toimeksiantaja voi turvautua asianmukaiseen suojatoimenpiteeseen ja/tai luopua noudattamasta tämän sopimuksen säännöksiä. 8.5 Kohdan 8 säännökset ovat voimassa myös tämän sopimuksen päättymisen tai irtisanomisen jälkeen. 9. Velvollisuuksien vastavuoroisuus 9.1 Ei toimeksiantajalla eikä toimeksisaajalla ole velvollisuutta toimittaa työsuorituksia tai palveluja tulevaisuudessa, kun tämän sopimuksen mukaisten palvelujen tarjoaminen on suoritettu loppuun tai tämä sopimus on mistä tahansa syystä päättynyt. 10. Kevytyrittäjyys 10.1 Tämän sopimuksen toimeksiantajan kanssa toimeksisaaja on tehnyt kevyrittäjänä. Selvyyden vuoksi mainittakoon, että toimeksisaaja toimii tämän sopimuksen yhteydessä riippumattomana konsulttina. Toimeksisaaja ei ole nyt eikä tulevaisuudessa toimeksiantajan työntekijä tai edustaja, ja toimeksisaaja ottaa täyden vastuun toimistaan ja laiminlyönneistään. 11. Korvausvelvollisuus 11.1 Toimeksisaaja on korvausvelvollinen ja pysyy korvausvelvollisena toimeksiantajalle, sen johtajille, työntekijöille ja edustajille kaikkien toimien, vaatimusten, kulujen, kustannusten, vahinkojen ja vastuiden osalta, jotka aiheutuvat tai ovat seurausta mistä tahansa toimeksisaajan huolimattomasta, väärästä tai laittomasta toimesta tai laiminlyönnistä. 11.2 Rajoittamatta edellä sanottua toimeksisaaja sitoutuu täten olemaan korvausvelvollinen ja pysymään korvausvelvollisena toimeksiantajalle minkä tahansa vahingon, vaatimuksen, menetyksen, kustannuksen, väitteen, toimen tai vastuun osalta, joka johtuu siitä, että toimeksisaaja on rikkonut tätä sopimusta. 12. Vastuu 12.1 Missään tapauksessa kumpikaan osapuoli ei ole vastuussa toiselle mistään epäsuorasta, erityisestä tai välillisestä menetyksestä tai vahingosta, joka aiheutuu tästä sopimuksesta tai liittyy siihen. Erityisesti ja rajoittumatta edellä mainittuun kumpikaan osapuoli ei ole vastuussa toisen kärsimästä liiketoiminnan, tuoton, voiton, edellytetyn säästö ja liikearvon menetyksestä, paitsi jos sellainen menetys syntyy tämän sopimuksen rikkomisen tuloksena. 12.2 Kumpikaan osapuoli ei sulje pois tai rajoita vastuuta kuolemasta tai henkilövahingosta vain siinä määrin kuin sama syntyy hänen itsensä tai hänen työntekijöidensä, edustajiensa tai valtuutettujen edustajiensa huolimattomuuden seurauksena. 13. ALV 13.1 Kaikki summat, jotka toimeksiantajan on maksettava toimeksisaajalle, ovat verottomia, ellei toisin sovita, joten arvonlisäverosta vastaa toimeksisaaja ja se veloitetaan laskutuspäivänä voimassa olevan palkkiomäärän lisäksi. 14. Julkisuus 14.1 Toimeksisaaja ei julkista tähän sopimukseen tai sen asiasisältöön liittyviä tietoja muuhun tarkoitukseen kuin tässä sopimuksessa sallittuihin tarkoituksiin ja toimeksiantajan suostumuksella tai jos niiden julkistamista vaatii laki. 15. Vakuutukset 15.1 Tämän sopimuksen edellytyksenä on, että toimeksisaaja ottaa ammatillisen vastuuvakuutuksen vähintään 1 miljoonalle punnalle sekä työnantajan vastuun ja julkisen vastuun vakuutuksen yhteensä vähintään 1 miljoonalle punnalle koko sopimuksen määräajaksi (mukaan lukien sovittu jatkoaika) ja toimittaa toimeksiantajan pyynnöstä toimeksiantajalle 7 päivän kuluessa kunkin vakuutustodistuksen kopion. 17. Jaettavuus 17.1 Jos jokin tämän sopimuksen säännös tai osa on pätemätön tai täytäntöönpanokelvoton, sopimuksen muiden säännösten ja osien voimassaolo jatkuu kaikilta osin. 18. Luopuminen 18.1 Jommankumman osapuolen luopumista jostakin tämän sopimuksen laiminlyönnistä tai rikkomisesta ei pidetä luopumisena sen muusta tai seuraavasta laiminlyönnistä tai rikkomisesta. 19. Koko sopimus 19.1 Tätä sopimusta ei voida muuttaa tai täydentää muulla tavalla kuin osapuolten välisellä kirjallisella sopimuksella, jonka molemmat osapuolet vahvistavat allekirjoituksellaan. 20. Rakenne 20.1 Väliotsikot on lisätty vain mukavuussyistä, eikä niitä saa käyttää minkä tahansa tämän sopimuksen säännöksen rakentamiseen. 21. Sovellettava laki 21.1 Tähän sopimukseen ja sen tulkintaan sovelletaan Suomen lakia. Osapuolet sopivat antavansa yksinomaisen toimivallan Suomen tuomioistuimille.
fi: 1. Palvelujen tarjoaminen 1.1 Toimeksisaaja tarjoaa toimeksiantajalle palveluja, jotka on täsmennetty liitteessä I (ja mahdollisissa toimeksiantajan ja toimeksisaajan kesken myöhemmin tehtävissä liitteissä, jotka täydentävät ajoittain tätä sopimusta ja muodostavat sen osan) ja jotka ovat tämän sopimuksen ehtojen kohteena. Toimeksisaaja käyttää kohtuullisia keinoja noudattaakseen kaikkia aikatauluja tai muita tavoitteita toimeksiantajan ja toimeksisaajan kesken kirjallisesti sovittujen palvelujen etenemistä, toimittamista tai loppuun saattamista varten. 1.2 Toimeksisaaja varmistaa, että hän noudattaa palveluja tarjotessaan kaikkia palvelujen tarjoamisen kannalta merkityksellisiä sovellettavia lakeja, asetuksia ja määräyksiä (mukaan lukien mutta ei ainoastaan lakisääteisiä velvoitteita sekä tietosuojaa, terveyttä ja turvallisuutta koskevia säädöksiä). 1.3 Toimeksisaaja noudattaa kaikkia kohtuullisia turvallisuusstandardeja sekä toimeksiantajan kulloinkin voimassa olevia terveys- ja turvallisuusmenettelyjä sekä raportoi toimeksiantajalle kaikista epäturvallisista työskentelyoloista ja -käytänteistä. 1.4 Toimeksisaaja noudattaa toimeksiantajan käytänteitä, jotka koskevat sosiaalisen median käyttöä, luottamuksellisuutta, turvallisuutta, tietojenkäsittely- ja tietoliikennejärjestelmien käyttöä, syrjinnän ja kiusaamisen ehkäisyä, menettelysääntöjä sekä kaikkia muita toimeksiantajan silloin tällöin julkaisemia käytänteitä, jotka koskevat urakoitsijoita. 1.5 Toimeksisaaja tarjoaa palveluja huolellisesti ja ammattitaitoisesti sekä myötävaikuttaa kaikkiin laadunvarmistustoimenpiteisiin, joista toimeksiantaja ilmoittaa toimeksisaajalle. 1.6 Minkä tahansa palvelujen tuloksena syntyneen virheellisen tai viallisen työsuorituksen toimeksisaaja korjaa omalla ajalla ja kustannuksella. 1.7 Palveluja tarjotaan toimeksiantajan silloin tällöin täsmentämillä työmailla. 1.8 Toimeksiantaja antaa toimeksisaajan käyttöön laitteet, joita voidaan kohtuullisesti tarvita palvelujen tarjoamiseen, muun muassa (tarvittaessa) asianmukaisen tietokoneen, ääni- ja datatekniikan ja sopivan auton (yrityskäyttöön asianmukaisesti vakuutettuna). Sellaisten laitteiden asianmukainen vakuuttaminen on toimeksiantajan vastuulla. 1.9 Toimeksisaajalta ei vaadita palvelujen ulkopuolelle jäävän neuvon ja avun antamista. 1.10 Paitsi siinä määrin kuin toimeksiantaja vaatii sekä kokousten ja yhteydenpidon järjestäminen pakottaa, toimeksisaaja määrää palvelujen tarjoamisen ajan ja paikan, ja tässä sopimuksessa säädettyä lukuun ottamatta toimeksisaaja ja toimeksisaajan edustajat eivät toimi toimeksiantajan valvonnassa palvelujen tarjoamisen luonteen, paikan, ajan tai tavan osalta. 1.11 Toimeksisaaja noudattaa EU:n työaikadirektiiviä 2003 sellaisena kuin sitä sovelletaan EU:n jäsenmaassa, jossa palveluja tarjoava toimeksisaaja suorittaa toimeksiantoa. Toimeksisaaja voi ottaa loman ilmoittamalla siitä kohtuullisessa ajassa etukäteen. Selvyyden vuoksi mainittakoon, että toimeksiantaja ei ole vastuussa lomarahojen maksamisesta kenelle tahansa toimeksisaajalle. 1.12 Toimeksisaaja: (a) noudattaa kaikkia sovellettavia lahjonnan ja korruption vastaisia lakeja, määräyksiä, säännöstöjä ja seuraamuksia, mukaan lukien mutta ei ainoastaan kaikkia sovellettavia rahanpesun, lahjonnan ja korruption vastaisia säädöksiä; (b) noudattaa kaikkia toimeksiantajan julkaisemia eettisiä sekä lahjonnan ja korruption vastaisia käytänteitä; (e) raportoi välittömästi toimeksiantajalle mistä tahansa aiheettoman taloudellisen tai muun edun pyynnöstä tai vaatimuksesta, jonka toimeksisaaja on saanut palvelujen tarjoamisen yhteydessä. 1.13 Kohdan 1.12 noudattamatta jättäminen johtaa tämän sopimuksen välittömään päättymiseen ilman irtisanomisaikaa. 2. Maksaminen 2.1 Työsuorituksen ollessa tyydyttävä toimeksiantaja suostuu maksamaan palveluista toimeksisaajalle asianmukaisessa liitteessä täsmennetyn aikataulun ja hinnaston mukaan. Toimeksiantaja suorittaa maksut toimeksisaajalle kuukausittain jälkikäteen 7 päivän kuluessa saatuaan toimeksisaajan allekirjoittaman pätevän ja täsmällisen laskun, jota tukevat työaikalomakkeet (tai tarvittaessa projektiraportit, joissa on esitetty yksityiskohtaisesti työsuoritus ja eritelty käytetty tuntimäärä). 2.2 Suoritetut maksut liittyvät vain sellaisiin päiviin tai sellaisten päivien osuuteen, jolloin palveluja on todella tarjottu, ja toimeksiantaja ei suorita mitään maksua, ellei laskua tue toimeksiantajan edustajan ohjeiden mukaan oikein täytetty ja toimeksiantajan edustajan asianmukaisesti hyväksymä työaikalomake. Työaikalomakkeiden hankkiminen toimeksiantajalta ja hyväksyttäminen toimeksiantajalla on toimeksisaajan velvollisuus. 3. Kulut 3.1 Toimeksiantaja ei korvaa toimeksisaajalle mitään koituneita kuluja, ellei aikataulussa toisin mainita. 4. Voimassaoloaika ja päättyminen 4.1 Tämä sopimus jää voimaan, kunnes kaikki toimeksiannot on suoritettu asianmukaisissa liitteissä määritellyllä tavalla, ellei sitä sanota irti aikaisemmin tämän sopimuksen ehtojen mukaan tai jatketa toimeksiantajan ja toimeksisaajan välisellä sopimuksella. 4.2 Rajoittamatta muiden oikeuksien tai keinojen soveltamista, joihin toimeksiantaja voi olla oikeutettu tämän sopimuksen mukaan, toimeksiantaja voi päättää tämän sopimuksen ilman irtisanomista ja välittömin vaikutuksin ja ilman velvollisuutta suorittaa toimeksisaajalle lisää maksuja (muita kuin ennen sellaisen päättämisen päivämäärää kertyneitä rahamääriä), jos milloin tahansa: 4.2.1 toimeksisaaja rikkoo tai jättää noudattamatta vakavasti tai toistuvasti minkä tahansa tämän sopimuksen säännöksen tai kieltäytyy noudattamasta mitä tahansa toimeksiantajan kohtuullisia ja laillisia ohjeita tai lyö sellaiset ohjeet laimin; 4.2.2 toimeksisaaja syyllistyy mihin tahansa rikokseen (lukuun ottamatta tieliikennerikkomusta, josta seuraa sakko tai vankeusrangaistukselle vaihtoehtoinen seuraamus); 4.2.3 toimeksisaaja on toimeksiantajan kohtuullisen lausunnon mukaan palveluja tarjotessaan huolimaton tai epäpätevä; 4.2.4 toimeksisaaja ajautuu konkurssiin tai hakeutuu vapaaehtoiseen velkajärjestelyyn; 4.2.5 toimeksisaaja syyllistyy petokseen tai epärehellisyyteen tai toimii millä tahansa tavalla, joka toimeksiantajan mielestä saattaa tai voi saattaa toimeksisaajan tai toimeksiantajan huonoon maineeseen tai loukkaa toimeksiantajan varallisia etuja; 4.2.6 toimeksisaaja rikkoo vakavasti toimeksiantajan käytänteitä ja menettelytapoja; taikka 4.2.8 toimeksisaaja päästää tahallaan tai tuottamuksesta viruksen tai muun haitallisen koodin toimeksisaajan tai toimeksiantajan laitteistoon tai ohjelmistoon, jota käytetään palvelujen tarjoamisessa. 4.3 Milloin tahansa tämän sopimuksen voimassaoloaikana ja joka tapauksessa tämän sopimuksen päättyessä mistä tahansa syystä: 4.3.1 toimeksiantajalla on oikeus saada kopio koko toimeksisaajan tekemästä tai loppuun suorittamasta työstä, joka liittyy tämän sopimuksen mukaisten palvelujen tarjoamiseen, sellaisessa muodossa, jossa se kulloinkin on; sekä 4.3.2 toimeksisaaja palauttaa toimeksiantajalle kaikki laitteet, asiakirjat ja muun toimeksisaajan hallussa olevan toimeksiantajalle kuuluvan omaisuuden. 4.4 Toimeksiantaja voi toimeksisaajan kanssa tekemällään sopimuksella jatkaa sopimuksen voimassaoloaikaa osapuolten kesken sovituksi ajaksi. 5. Immateriaaliomaisuus 5.1 Kaikki immateriaalioikeudet riippumatta niiden luonteesta (mukaan lukien mutta ei ainoastaan tekijän-, malli- ja patenttioikeudet), jotka koskevat mitä tahansa toimeksisaajan palvelujen tarjoamisen aikana tekemää työtä tai tuottamaa aineistoa (”projektiaineisto”), kuuluvat aina toimeksiantajalle ja ovat vapaita mistä tahansa toimeksisaajan, toimeksisaajan edustajan tai kolmannen osapuolen eduista. Toimeksisaaja tekee kaiken mitä toimeksiantaja voi vaatia kohtuudella valvoakseen sellaisten oikeuksien kuulumista toimeksiantajalle tai toimeksiantajan täsmentämälle kolmannelle osapuolelle tai todistaakseen samaa (joko ennen tämän sopimuksen päättymistä tai sen jälkeen). 5.2 Toimeksiantaja säilyttää kaikkien immateriaalioikeuksien omistuksen riippumatta niiden luonteesta ja hänen omistukseensa jäävät – jos rekisteröitävissä, joko rekisteröity tai ei – toimeksisaajalle tämän sopimuksen yhteydessä annetut asiakirjat tai muu aineisto, data ja muut tiedot. 5.3 Toimeksisaaja paljastaa välittömästi toimeksiantajalle kaikki ideat, menetelmät, keksinnöt, löydöt, mallit, konseptit tai muut työsuoritukset, jotka toimeksisaaja on tehnyt tai luonut palvelujen tarjoamisen aikana. 5.4. Toimeksisaaja takaa, että tarjotut palvelut eivät loukkaa kenenkään kolmannen osapuolen immateriaalioikeuksia, ja korvaa toimeksiantajalle kaikki toimenpiteet, vaatimukset, kulut, kustannukset, vahingot, pyynnöt ja vastuut, jotka aiheutuvat tai ovat seurausta mistä tahansa kolmannen osapuolen väitteestä, että toimeksisaajan tähän sopimukseen liittyvän työsuorituksen tai hänen toimittamansa sisällön käyttö tai hallussapito loukkaa kyseisen kolmannen osapuolen immateriaalioikeuksia, paitsi jos sellainen loukkaaminen johtuu suoraan toimeksiantajan antamien tietojen noudattamisesta. 5.5 Täten toimeksisaaja luopuu ehdottomasti, peruuttamattomasti ja ikuisesti kaikista moraalisista ja muista samanluonteisista oikeuksista projektiaineistoon kaikkien maiden lakien mukaan. 5.6 Kohdan 5 säännökset ovat voimassa myös tämän sopimuksen päättymisen tai irtisanomisen jälkeen. 6. Ylivoimainen este 6.1 Kumpikaan osapuoli ei ole vastuussa toiselle osapuolelle viivästyksestä tai katoamisesta, joka aiheutuu sellaisesta olosuhteesta, jota hän ei pysty kohtuullisilla ponnistuksilla hallitsemaan tai estämään (mukaan lukien mutta ei ainoastaan sota, työmarkkinakiista, tulipalo, räjähdys, luonnonkatastrofi, kuolema). 7. Muu toiminta 7.1 Mikään tässä sopimuksessa ei estä toimeksisaajaa olemasta asianosaisena tai omistamasta kuinka tahansa suurta taloudellista etua missä tahansa muussa liiketoiminnassa, kaupassa, ammatissa tai toimessa tämän sopimuksen voimassaoloaikana ja tämän sopimuksen päättymisen jälkeen, mikäli sellainen toiminta ei aiheuta toimeksisaajan tämän sopimuksen mukaisten (etenkin kohdassa 8 tarkoitettujen) velvollisuuksien laiminlyöntiä. 8. Luottamuksellisuus 8.1 Termi ”luottamuksellinen tieto” tarkoittaa kaikkia tämän sopimuksen tuloksena toimeksiantajan tai kolmannen osapuolen paljastamia tai muulla tavoin häneltä saatuja aineistoja ja tietoja, sekä kirjallisia että suullisia, mukaan lukien mutta ei ainoastaan seuraavia: 8.1.1 tekninen, taloudellinen, kaupallinen tai muu tieto, joka koskee toimeksiantajan tai kolmannen osapuolen tai heidän tytäryhtiöidensä, asiakkaidensa, edustajiensa, alihankkijoidensa liiketoimintaa, rahoitusasioita, toimintatapoja tai ehdotettuja toimintatapoja, tilejä, tilitapahtumia tai tuotteita, ehdotettuja tilitapahtumia tai ehdotettuja tuotteita, turvamenettelyjä, liikesalaisuuksia, osaamista, keksintöjä, sisäisiä tarkastuksia tai tietokone- tai tietojenkäsittelyohjelmia, algoritmeja, sähköisiä tietojenkäsittelysovelluksia, rutiineja, alirutiineja, tekniikoita tai järjestelmiä 8.1.2 tieto tai data, joka liittyy toimeksiantajan tai kolmannen osapuolen järjestelmiin, toimintaan, käytänteisiin, menettelytapoihin, tekniikkoihin, liiketoimintasuunnitelmiin, tileihin tai henkilöstöön 8.1.3 tunniste- ja muut vastaavat tiedot toimeksiantajan tai kolmannen osapuolen tavarantoimittajista ja asiakkaista. 8.2 Edellä olevan estämättä ”luottamuksellisena tietona” ei pidetä tietoa, joka: 8.2.1 tulee yleisesti yleisön saataville ilman toimeksisaajan tekoa tai oletusarvoisesti 8.2.2 oli jo ennen luottamuksellisen tiedon saantia toimeksiantajalta tai kolmannelta osapuolelta toimeksisaajan käytettävissä ilman paljastamista koskevia rajoituksia. 8.3 Toimeksisaaja suostuu: 8.3.1 toteuttamaan kaikki kohtuulliset toimenpiteet luottamuksellisen tiedon suojaamiseksi luvattomalta tai tahattomalta paljastamiselta, muun muassa sellaiset, jotka suojaavat tietoa vähintään yhtä tehokkaasti kuin toimenpiteet, joilla hän suojaa samanluonteisia omia tietojaan 8.3.2 olemaan julkistamatta tai paljastamatta tosiasiaa, että luottamuksellinen tieto on saatettu saataville tai että hän on tehnyt kyseistä aihetta koskevan sopimuksen 8.3.3 sallimaan yrityksen sisäisen pääsyn luottamukselliseen tietoon vain sellaisille työntekijöille ja ulkopuolisille konsulteille, joiden ”pitää tietää” se ja jotka ovat joko sellaisten salassapitokäytänteiden asianosaisia, jotka toimeksiantaja on ottanut käyttöön heidän työnantajanaan, tai ovat tehneet kohtuullisen salassapitosopimuksen, jonka nojalla voidaan pitää luottamukselliset tiedot salassa 8.3.4 olemaan vastuussa mistä tahansa tämän sopimuksen rikkomisesta työntekijöidensä, ulkopuolisten konsulttiensa tai edustajiensa toimesta 8.3.5 siihen, että luottamuksellisen tiedon palauttamisesta huolimatta tämän kohdan 8 mukaan hän pitää jatkuvasti salassa kaikki luottamukselliset tiedot ja varmistaa, että sitä tekevät myös hänen työntekijänsä, ulkopuoliset konsulttinsa ja edustajansa, mikä velvollisuus pysyy myös tämän sopimuksen päättymisen tai irtisanomisen jälkeen 8.3.6 siihen, että toimeksiantajalla on oikeus sellaiseen toimivaltaisen tuomioistuimen kieltotuomioon tai muuhun vastaavaan määräykseen, joka voi olla välttämätön tai asianmukainen ehkäisemään mitä tahansa luottamuksellisen tiedon käyttöä tai paljastamista millä tahansa tavalla, jota toimeksiantaja tai kolmas osapuoli ei ole sallinut, ilman tarvetta näyttää toteen todelliset vahingot sellaisten vahinkojen lisäksi ja riippumatta sellaisista vahingoista, jotka toimeksiantaja tai kolmas osapuoli on aiheuttanut rikkomisen tuloksena; sekä 8.3.7 siihen, että toimeksiantajan pyynnöstä milloin tahansa toimeksisaaja viipymättä joko toimittaa toimeksiantajalle kaikki aineellisessa muodossa olevat luottamukselliset tiedot, jotka ovat hänen hallussaan tai hallinnassaan, tai toimeksiantajan näin määrätessä vakuuttaa kirjallisesti toimeksiantajalle, että kaikki sellaiset luottamukselliset tiedot on hävitetty. 8.4 Jos toimeksisaajaa pyydetään tai vaaditaan (suullisella kysymyksellä, kuulustelulla, tieto- tai asiakirjojapyynnöllä, haasteella, siviilioikeudellisella tutkintavaatimuksella tai muulla vastaavalla menettelyllä) paljastamaan mitä tahansa luottamuksellista tietoa, on sovittu, että hänen tulee lain sallimassa laajuudessa ilmoittaa viipymättä toimeksiantajalle sellaisesta pyynnöstä tai velvollisuudesta, jotta toimeksiantaja voi turvautua asianmukaiseen suojatoimenpiteeseen ja/tai luopua noudattamasta tämän sopimuksen säännöksiä. 8.5 Kohdan 8 säännökset ovat voimassa myös tämän sopimuksen päättymisen tai irtisanomisen jälkeen. 9. Velvollisuuksien vastavuoroisuus 9.1 Ei toimeksiantajalla eikä toimeksisaajalla ole velvollisuutta toimittaa työsuorituksia tai palveluja tulevaisuudessa, kun tämän sopimuksen mukaisten palvelujen tarjoaminen on suoritettu loppuun tai tämä sopimus on mistä tahansa syystä päättynyt. 10. Kevytyrittäjyys 10.1 Tämän sopimuksen toimeksiantajan kanssa toimeksisaaja on tehnyt kevyrittäjänä. Selvyyden vuoksi mainittakoon, että toimeksisaaja toimii tämän sopimuksen yhteydessä riippumattomana konsulttina. Toimeksisaaja ei ole nyt eikä tulevaisuudessa toimeksiantajan työntekijä tai edustaja, ja toimeksisaaja ottaa täyden vastuun toimistaan ja laiminlyönneistään. 11. Korvausvelvollisuus 11.1 Toimeksisaaja on korvausvelvollinen ja pysyy korvausvelvollisena toimeksiantajalle, sen johtajille, työntekijöille ja edustajille kaikkien toimien, vaatimusten, kulujen, kustannusten, vahinkojen ja vastuiden osalta, jotka aiheutuvat tai ovat seurausta mistä tahansa toimeksisaajan huolimattomasta, väärästä tai laittomasta toimesta tai laiminlyönnistä. 11.2 Rajoittamatta edellä sanottua toimeksisaaja sitoutuu täten olemaan korvausvelvollinen ja pysymään korvausvelvollisena toimeksiantajalle minkä tahansa vahingon, vaatimuksen, menetyksen, kustannuksen, väitteen, toimen tai vastuun osalta, joka johtuu siitä, että toimeksisaaja on rikkonut tätä sopimusta. 12. Vastuu 12.1 Missään tapauksessa kumpikaan osapuoli ei ole vastuussa toiselle mistään epäsuorasta, erityisestä tai välillisestä menetyksestä tai vahingosta, joka aiheutuu tästä sopimuksesta tai liittyy siihen. Erityisesti ja rajoittumatta edellä mainittuun kumpikaan osapuoli ei ole vastuussa toisen kärsimästä liiketoiminnan, tuoton, voiton, edellytetyn säästö ja liikearvon menetyksestä, paitsi jos sellainen menetys syntyy tämän sopimuksen rikkomisen tuloksena. 12.2 Kumpikaan osapuoli ei sulje pois tai rajoita vastuuta kuolemasta tai henkilövahingosta vain siinä määrin kuin sama syntyy hänen itsensä tai hänen työntekijöidensä, edustajiensa tai valtuutettujen edustajiensa huolimattomuuden seurauksena. 13. ALV 13.1 Kaikki summat, jotka toimeksiantajan on maksettava toimeksisaajalle, ovat verottomia, ellei toisin sovita, joten arvonlisäverosta vastaa toimeksisaaja ja se veloitetaan laskutuspäivänä voimassa olevan palkkiomäärän lisäksi. 14. Julkisuus 14.1 Toimeksisaaja ei julkista tähän sopimukseen tai sen asiasisältöön liittyviä tietoja muuhun tarkoitukseen kuin tässä sopimuksessa sallittuihin tarkoituksiin ja toimeksiantajan suostumuksella tai jos niiden julkistamista vaatii laki. 15. Vakuutukset 15.1 Tämän sopimuksen edellytyksenä on, että toimeksisaaja ottaa ammatillisen vastuuvakuutuksen vähintään 1 miljoonalle punnalle sekä työnantajan vastuun ja julkisen vastuun vakuutuksen yhteensä vähintään 1 miljoonalle punnalle koko sopimuksen määräajaksi (mukaan lukien sovittu jatkoaika) ja toimittaa toimeksiantajan pyynnöstä toimeksiantajalle 7 päivän kuluessa kunkin vakuutustodistuksen kopion. 17. Jaettavuus 17.1 Jos jokin tämän sopimuksen säännös tai osa on pätemätön tai täytäntöönpanokelvoton, sopimuksen muiden säännösten ja osien voimassaolo jatkuu kaikilta osin. 18. Luopuminen 18.1 Jommankumman osapuolen luopumista jostakin tämän sopimuksen laiminlyönnistä tai rikkomisesta ei pidetä luopumisena sen muusta tai seuraavasta laiminlyönnistä tai rikkomisesta. 19. Koko sopimus 19.1 Tätä sopimusta ei voida muuttaa tai täydentää muulla tavalla kuin osapuolten välisellä kirjallisella sopimuksella, jonka molemmat osapuolet vahvistavat allekirjoituksellaan. 20. Rakenne 20.1 Väliotsikot on lisätty vain mukavuussyistä, eikä niitä saa käyttää minkä tahansa tämän sopimuksen säännöksen rakentamiseen. 21. Sovellettava laki 21.1 Tähän sopimukseen ja sen tulkintaan sovelletaan Suomen lakia. Osapuolet sopivat antavansa yksinomaisen toimivallan Suomen tuomioistuimille.
