Repository: prashant-v-53/Way-2-work
Catalog: lib/l10n/intl_*.arb
Languages: et, fi

source: Tax Card
et: maksumaksja kaardi
fi: Verokortti

source: Food Compensation
et: Lõuna hüvitis
fi: Ateriakorvaus

source: Hours Worked
et: Töötatud tunnid
fi: Tunteja työskennelty

source: Amount
et: Kokku
fi: Määrä

# contruction
source: Construction sector reverse charge AVL 8 c §
et: Ehitussektori KM pöördmaksustus AVL 8 c §
fi: Rakennusalan AVL 8 c §

source: not selected
et: pole valitud
fi: ei valittu

# registerSuccessfull
source: Registration successful! Your account is being reviewed.
et: Registreerimine õnnestus!Teie konto on läbivaatamisel.
fi: Rekisteröinti onnistui! Tiliäsi tarkistetaan.

source: Value
et: Hind
fi: Arvo

source: Workbook
et: Tööraamat
fi: Työlistat

source: Male
et: mees
fi: mies

source: Female
et: naine
fi: nainen

source: Add details
et: Lisa päevakiri
fi: Työkirjaukset

source: No invoices
et: Arved puuduvad
fi: Laskuja ei löydy

source: Enter valid confirm password
et: Sisestage kehtiv kinnita salasõna
fi: Syötä vahvista salsana

source: Confirm Password
et: Kinnita salasõna
fi: Vahvista salsana

source: Company
et: Ettevõte
fi: Yritys

# client
source: Private customer
et: Eraisik
fi: Yksityishenkilö

source: Invoice Recipient
et: Arve saaja
fi: Laskun saaja

source: Work details
et: Üksikasjad
fi: Lisää tietoja

source: Please Add or Update your Tax Card
et: Lisage või värskendage oma maksukaarti
fi: Lisää tai päivitä verokortti

source: Distance Travelled
et: Sõidukompensatsioon
fi: Kilometrikorvaus

source: Construction
et: Ehitus
fi: Rakentaminen

source: Cleaning Services
et: Puhastusteenused
fi: Siivouspalvelut

source: Transportation Services
et: Transporditeenused
fi: Kuljetuspalvelut

source: Not In Use
et: Ei ole kasutuses
fi: Ei käytössä

source: Enter valid hours value
et: Sisestage kehtiv tunnihind
fi: Syötä kelvollinen laskutushinta

source: Enter valid pieces value
et: Sisestage kehtiv tükkide väärtus
fi: Syötä kelvollinen kappaleen arvo

source: Enter valid km
et: Sisestage kehtiv kilomeetrid
fi: Syötä kelvollinen kilometrit

source: Enter valid document name
et: Sisestage kehtiv Dokumendi nimi
fi: Syötä kelvollinen Asiakirjan nimi

source: Send Invitation
et: Saada kutse
fi: Lähetä kutsu

source: Link
fi: Linkki

source: Link copy successfully
et: Linkimise kopeerimine õnnestus
fi: Linkin kopiointi onnistui

# invitationLinkSentSuccessfully
source: Invitation link send successfully
et: Kutse lingi saatmine õnnestus
fi: Kutsulinkin lähetys onnistui
