Repository: prashant-v-53/Way-2-work
Catalog: lib/l10n/intl_*.arb
Languages: et, fi

# localeCode
source: EN
et: ET
fi: FI

# languageName
source: English
et: Estonian
fi: Finnish

source: Enter valid email
et: Sisestage kehtiv E-posti aadress
fi: Tarkista sähköpostisi

source: Enter valid password
et: Sisestage kehtiv parool
fi: Syötä salasana

# checkYourEmailNow
source: Check your E-mail
et: Kontrollige oma E-posti aadress
fi: Tarkista sähköpostisi nyt

# enterValidTaxNo
source: Enter valid tax number
et: Sisestage kehtiv maksunumber
fi: Syötä kelvollinen veronumero

# enterValidSsnNo
source: Enter valid SSN number
et: Sisestage kehtiv isikukood
fi: Syötä kelvollinen henkilötunnus

source: Enter valid full name
et: Sisestage kehtiv täisnimi
fi: Syötä kokonimi

source: Either SSN or Y-Tunnus should be provided
et: Peate sisestama isikukoodi või registrikoodi
fi: Syötä henkilötunnus tai Y-tunnus

source: Please select date
et: Palun valige kuupäev
fi: Valitse päivämäärä

source: Updated Successfully
et: Värskendatud!
fi: Päivitetty onnistuneesti

# addWorkSucessfully
source: Add work successfully
et: Üksikasjad lisatud edukalt!
fi: Lisättiin työ onnistuneesti

source: Deleted Successfully
et: Kustutamine õnnestus!
fi: Poistettu onnistuneesti

source: No image selected
et: Ühtegi pilti pole valitud
fi: Ei kuvaa valittu

source: Contract value not grater than total work value
et: Lepingu väärtus ei ole kõrgem kui kogu töö väärtus
fi: Sopimuksen kesto ei ole isompi kuin työn kokonaiskesto

source: Invoice created successfully
et: Arve koostamine õnnestus
fi: Laskun luominen onnistui

source: Alert!
et: Hoiatus!
fi: Varoitus!

source: Are you sure want to logout?
et: Kas soovite kindlasti välja logida?
fi: Haluatko varmasti kirjautua ulos?

source: No
et: Ei
fi: EI

source: Please only select pieces
et: Valige tükid
fi: Valitse kappaleet

source: Please only select hours
et: Valige tunnid
fi: Valitse tunnit

source: Select atleast one worked hour
et: Valige vähemalt üks tööpäev
fi: Valitse vähintään yksi työtunti

source: Insurance Service
et: Kindlustusteenus
fi: Vakuutuspalvelu

source: Insurance Number
et: Kindlustusnumber
fi: Vakuutusnumero

source: Insurance Email
et: Kindlustuse E-post
fi: Vakuutussähköposti

source: Website
et: Veebisait
fi: Verkkosivusto

source: Package
et: Pakett
fi: Paketti

source: Action
et: Tegevus
fi: Toiminta

source: Press again to exit app
et: Rakendusest väljumiseks vajutage uuesti
fi: Poistu sovelluksesta painamalla uudelleen

source: Email
et: E-post
fi: Sähköposti

source: Password
et: Parool
fi: Salasana

source: Sign up
et: Registreeri
fi: Rekisteröidy

source: Full Name
et: Täisnimi
fi: Koko nimi

source: Tax Number
et: Maksunumber
fi: Veronumero

source: Next
et: Järgmine
fi: Seuraava

source: Add work details
et: Lisage töö üksikasjad
fi: Lisää Töitä

source: Contract Type
et: Lepingu liik
fi: Sopimustyyppi

source: Date
et: Kuupäev
fi: Päivämäärä

source: Trip Start
et: Reisi algus
fi: Matka alkaa

source: Trip Ends
et: Reis lõpeb
fi: Matka päättyy

source: Trip Addresses
et: Reisi aadressid
fi: Matkan osoitteet

source: Number of hours worked
et: Töötundide arv
fi: Työtuntien määrä

source: Number of pieces
et: Tükkide arv
fi: Palojen lukumäärä

source: Lunch compensation
et: Lõuna hüvitis
fi: Ateriakorvaus

source: Trip Time
et: Reisi aeg
fi: Matkan kesto

source: Other Compensations
et: Muud hüvitised
fi: Muut korvaukset

source: Work Description
et: Töö kirjeldus
fi: Työn kuvaus

source: Enter trip addresses
et: Sisestage reisi aadressid
fi: Syötä matkan osoitteet

source: Enter KM
et: Sisestage kilomeetrid
fi: Syötä kilometrit

source: Enter Amount
et: Sisestage summa
fi: Syötä summa

source: Enter trip time
et: Sisestage reisi aeg
fi: Syötä matkan kesto

source: Enter hours worked
et: Sisestage töötunnid
fi: Tunteja työskennelty

source: Enter pieces
et: Sisestage tükid
fi: Syötä määrä

source: Submit
et: Saada
fi: Lähetä

source: Manage
et: Halda
fi: Hallitse

source: Account
et: Profiil
fi: Asetukset

source: Update Profile
et: Uuenda Profiili
fi: Päivitä profiili

source: Gender
et: Sugu
fi: Sukupuoli

source: Date of Birth
et: Sünnikuupäev
fi: Syntymäaika

source: Current Address
et: Praegune aadress
fi: Nykyinen katuosoite

source: Residence
et: Elukoht
fi: Asuinpaikka

source: Nationality
et: Rahvus
fi: Kansalaisuus

source: Mobile Phone
et: Mobiiltelefon
fi: Puhelin

source: Home Phone
et: Kodutelefon
fi: Kotipuhelin

source: Dashboard
et: Töölaud
fi: Päänäkymä

source: Invoices
et: Arved
fi: Laskut

source: Invite
et: Kutsu
fi: Kutsu

# myCV
source: CV
fi: Ansioluettelo

source: Work Permit
et: Töölubat
fi: Työlupa

source: Work contract
et: Tööleping
fi: Työsopimus

source: Edit
et: Muuda
fi: Muokkaa

source: Social Security Number
et: Isikukood
fi: Henkilötunnus

source: Receive
et: Võta vastu
fi: Vastaanota

# notification
source: Notifications
et: Teavitused
fi: Ilmoitukset

# onn
source: On
et: Peal
fi: Päällä

source: Off
et: Väljas
fi: Pois päältä

source: Share Link
et: Jaga linki
fi: Jaa linkki

source: Register via share link report
et: Registreeru jagamislingi kaudu
fi: Rekisteröidy jakamislinkin kautta

source: Proffesional Summary
et: Professionaalne kokkuvõte
fi: Esikoulutuksen yhteenveto

source: Experience
et: Kogemus
fi: Kokemus

source: Education
et: Haridus
fi: Koulutus

source: My Job Applications
et: Minu taotlused
fi: Työhakemukseni

# myAdditionalInformation
source: Additional Information
et: Lisateave
fi: Lisätiedot

source: Personal Tax(%)
et: Isiklik maksu (%)
fi: Henkilökohtainen vero (%)

source: Max. Tax Percentage(%)
et: Ülemine maksu (%)
fi: Maksimi veroprosentti (%)

source: Yearly Income
et: Aastane sissetulek
fi: Tuloraja

# bankAccInformation
source: Bank Account Information
et: Pangakonto teave
fi: Pankkitilitiedot

source: Bank Name
et: Panga nimi
fi: Pankin nimi

source: Account Number
et: Konto number
fi: Tilinumero

source: BIC Number
fi: BIC-numero

source: Enter full name
et: Sisestage täisnimi
fi: Anna kokonimi

# enterCurrentAddres
source: Enter current address
et: Sisestage praegune aadress
fi: Syötä nykyinen osoite

# enterMobileNo
source: Enter mobile number
et: Sisestage mobiilinumber
fi: Syötä matkapuhelinnumero

source: Enter home phone
et: Sisestage kodune telefon
fi: Syötä kotipuhelin

source: Enter personal tax number
et: Sisestage isiklik maksunumber
fi: Syötä henkilökohtainen veronumero

source: Enter max tax percentage
et: Sisestage maksimaalne maksuprotsente
fi: Syötä korkein veroprosenttie

source: Enter yearly income
et: Sisestage aastane sissetulek
fi: Syötä vuositulot

source: Select Gender
et: Vali sugu
fi: Valitse sukupuoli

source: Select Nationality
et: Valige Kodakondsus
fi: Valitse kansallisuus

source: Update
et: Uuenda
fi: Päivitä

source: Day
et: Päev
fi: Päivä

source: Month
et: Kuu
fi: Kuukausi

source: Year
et: Aasta
fi: Vuosi

# addNewEmployers
source: Add new Client
et: Lisa uus Tellija
fi: Lisää asiakas

# nameOfEmployer
source: Client Name
et: Tellija nimi
fi: Toimeksiantajan nimi

# employerTelephone
source: Client Telephone
et: Tellija telefon
fi: Toimeksiantajan puhelin

# employerSSN
source: Client SSN
et: Tellija isikukood
fi: Toimeksiantajan henkilötunnus

# employerYTunnus
source: Client Business ID
et: Tellija registrikood
fi: Toimeksiantajan Y-tunnus

# emailOfEmployer
source: Client E-Mail
et: Tellija E-post
fi: Toimeksiantajan sähköpostiosoite

# employerTaxNo
source: Client tax number
et: Tellija maksunumber
fi: Toimeksiantajan veronumero

# addressOfEmploye
source: Client address
et: Tellija aadress
fi: Toimeksiantajan osoite

source: Add Attachment for Receipt
et: Lisage kviitungile manus
fi: Lisää kuitti

source: Other Expenses
et: Muud kulud
fi: Muut kulut

source: Other Files
et: Muud failid
fi: Muut tiedostots

source: Multiple Files
et: Mitu faili
fi: Useita tiedostoja

source: Reference
et: Viide
fi: Viite

source: Explanation
et: Selgitus
fi: Selitys

source: Select Country
et: Vali riik
fi: Valitse maa

source: City
et: Linn
fi: Kaupunki

source: Worked
et: Töötas
fi: Teki töitä

source: Hours
et: Tunnid
fi: Tunnit

source: Pieces
et: Tk
fi: Kpl

source: Showing Total Entries
et: Kuvatakse sisestusi kokku
fi: Näytetään ilmoitukset yhteensä

source: Created On
et: Loodud
fi: Luotu

# workedHours
source: Work Diary
et: Tööraamat
fi: Työpäiväkirja

source: Daily Compensation
et: Igapäevane hüvitis
fi: Päivittäinen korvaus

source: Extra Information
et: Lisainformatsioonn
fi: Lisätieto

source: Duplicate
et: Duplikaat
fi: Monista

source: Delete
et: Kustuta
fi: Poista

source: Use in invoice
et: Moodustage arve
fi: Liitä laskuusi

# employerDetails
source: Client Details
et: Tellija andmed
fi: Toimeksiantajan tiedot

source: Daily work details
et: Igapäevase töö andmed
fi: Päivittäisen työn yksityiskohdat

source: Invoice Data
et: Arve andmed
fi: Laskun tiedot

# addValidEmployerDetails
source: Add valid Client details
et: Lisage kehtiva Tellija andmed
fi: Lisää Tilajaan tiedot

source: Add valid daily work details
et: Lisage arve sisu
fi: Lisää päivittäiset työtiedot

source: Modify
et: Muuda
fi: Muokkaa

source: Add More
et: Lisage veel
fi: Lisää enemmän

source: Contract Value
et: Lepingu väärtus
fi: Sopimusarvo

source: Tax Vero
et: Maks
fi: ALV

# dueDate
source: Payment Term
et: Maksetingimus
fi: Maksuehto

source: Choose file
et: Vali fail
fi: Valitse tiedosto

source: No file choose
et: Faili pole valitud
fi: Ei valittua tiedostoa

source: Name
et: Nimi
fi: Nimi

source: Telephone
et: Telefon
fi: Puhelin

source: Address
et: Aadress
fi: Osoite

source: Type
et: Tüüp
fi: Tyyppi

source: Add New
et: Lisa uus
fi: Lisää uusi

source: Creation Date
et: Loomise kuupäev
fi: Luomispäivä

source: Invoice ID
et: Arve nr.
fi: Laskutunnus

source: Invoice To
et: Arve saaja
fi: Asiakas

source: Status
et: Staatus
fi: Tila

source: Paid Status
et: Arve seis
fi: Maksun tila

source: View
et: Vaata
fi: Näytä

source: Payment
et: Maksmine
fi: Maksu

# anInvoiceWithCompensation
source: Invoice with compensations
et: Arve kompensatsioonidega
fi: Lasku korvauksilla

source: Add
et: Lisa
fi: Lisää

# myDashboard
source: Dashboard
et: Töölaud
fi: Päänäkymä

# managePayment
source: Invoices
et: Arved
fi: Hallitse Maksuja

source: Manage Account
et: Halda kontot
fi: Hallitse Tiliäsi

source: Enter contract value
et: Sisestage lepingu väärtus
fi: Syötä sopimuksen arvo

source: Full/Half day compensation
et: Terve / poole päeva hüvitis
fi: Koko/osapäiväraha

source: Company Name
et: Ettevõtte nimi
fi: Yrityksen nimi

# savedAsDraft
source: Save as draft
et: Salvesta mustandina
fi: Tallenna luonnoksena

source: Invoice saved successfully
et: Arve salvestamine õnnestus
fi: Laskun tallennus onnistui

source: Distance
et: Kaugus
fi: Etäisyys

# makeInvoice
source: Create invoice
et: Koosta arve
fi: Luo lasku

source: Something went to wrong !
et: Midagi läks valesti!
fi: Jotain meni pieleen!

source: No Internet Connection
et: Interneti-ühendus puudub
fi: Ei Internet-yhteyttä

source: Camera
et: Kaamera
fi: Kamera

source: File
et: Fail
fi: Tiedosto

source: Image Deleted Successfully
et: Pilt on edukalt kustutatud
fi: Kuva poistettu

source: Please select employer
et: Valige tööandja
fi: Valitse työnantaja

source: Enter valid file name
et: Sisestage kehtiv faili nimi
fi: Anna kelvollinen tiedostonimi

source: Please select expiry date
et: Valige aegumiskuupäev
fi: Valitse viimeinen käyttöpäivämäärä

source: Please select file
et: Valige fail
fi: Valitse tiedosto

source: Work Safety Card
et: Tööohutuskaart
fi: Työturvallisuuskortti

source: ID Card
et: ID-Kaart
fi: ID-Kortti

source: Passport
et: Pass
fi: Passi

source: Driving License
et: Juhiluba
fi: Ajokortti

source: Residence Permit
et: Elamisluba
fi: Oleskelulupa

# mycv
source: CV
fi: Ansioluettelo

# otherDocuments
source: Other
et: Muu
fi: Muut

source: Please select document type
et: Valige dokumendi tüüp
fi: Valitse asiakirjan tyyppi

source: Enter valid yearly income
et: Sisestage kehtiv aastane sissetulek
fi: Anna kelvollinen vuositulo

source: Enter valid personal tax
et: Sisestage kehtiv isikumaks
fi: Anna voimassa oleva vero

source: Enter valid max tax percentage
et: Sisestage kehtiv maksimaalne maksuprotsent
fi: Anna kelvollinen korkein veroprosentti

source: Please select start date
et: Valige alguskuupäev
fi: Valitse aloituspäivä

# filesAreNotSavedYet
source: Files aren't saved yet but,
et: Faile pole veel salvestatud, kuid
fi: Tiedostoja ei ole vielä tallennettu, mutta

source: Draft saved successfully
et: Mustand on edukalt salvestatud
fi: Luonnos tallennettu onnistuneesti

source: Select area of field
et: Valige välja ala
fi: Valitse kenttäalue

source: Send
et: Saada
fi: Lähetä

source: Insurance request sent successfully
et: Kindlustustaotlus saadeti edukalt
fi: Vakuutuspyyntö lähetetty

source: No Internet
et: Interneti puudub
fi: Ei Internetiä

source: Check your internet connection and try again.
et: Kontrollige Interneti-ühendust ja proovige uuesti.
fi: Tarkista internetyhteytesi ja yritä uudelleen.

source: Insurance Name
et: Kindlustuse nimi
fi: Vakuutuksen nimi

source: Send Email
et: Saada email
fi: Lähetä sähköposti

source: Your Name
et: Sinu nimi
fi: Sinun nimesi

# yourProffesion
source: Your Profession
et: Sinu eriala
fi: Ammattisi

source: Light Entrepreneur SSN
et: Kerge ettevõtja SSN
fi: Kevyt yrittäjä SSN

source: YEL - approximate sum for 2020
et: YEL - ligikaudne summa aastaks 2020
fi: YEL - arvioitu summa vuodelle 2020

source: Phone
et: Telefon
fi: Puhelin

source: Terms And Conditions
et: Tingimused
fi: Käyttöehdot

source: Select language
et: Vali keel
fi: Valitse kieli

source: Save
et: Salvesta
fi: Tallenna

source: Income Level
et: Aastane sissetulek
fi: Tuloraja

# receiveDocument
source: Received Documents
et: Vastuvõetud Dokumendid
fi: Vastaanotetut Asiakirjat

source: Invoice Amount
et: Arve summa
fi: Laskun määrä

# payToAccount
source: Paid to account
et: Makstakse arvele
fi: Maksetaan tilille

source: Upload Contract
et: Üleslaadimisleping
fi: Lähetä sopimus

source: Select Employer
et: Valige Tööandja
fi: Valitse Työnantaja

source: File Name
et: Faili nimi
fi: Tiedoston nimi

source: Expiry Date
et: Kehtivuse lõppkuupäev
fi: Päättymispäivä

source: Upload File
et: Faili üles laadima
fi: Lataa tiedosto

source: Employer
et: Tööandja
fi: Työnantaja

source: Employer email
et: Tööandja e-post
fi: Työnantajan sähköposti

source: Employer phone
et: Tööandja telefon
fi: Työnantajan puhelin

source: Light Entrepreneur Email
et: Kerge ettevõtja e-post
fi: Kevyt yrittäjän sähköposti

source: Sent On
et: Saadetud
fi: Lähetetty

source: Document Title
et: Dokumendi pealkiri
fi: Asiakirjan nimi

source: Description
et: Kirjeldus
fi: Kuvaus

source: View File
et: Vaata faili
fi: Katso tiedosto

source: Pieces Value
et: Tükkide väärtus
fi: Kappaleen arvo

# hoursValue
source: Hour value
et: Tunnihind
fi: Laskutushinta

source: Total Amount
et: Kogusumma
fi: Yhteensä

source: Add my document
et: Lisa minu dokument
fi: Lisää asiakirjani

source: Document Type
et: Dokumendi liik
fi: Asiakirjan tyyppi

source: Start Date
et: Algus kuupäev
fi: Aloituspäivämäärä

source: Document Name
et: Dokumendi nimi
fi: Asiakirjan nimi

source: Light Entrepreneur Phone
et: Kerge ettevõtja telefon
fi: Kevyt yrittäjäpuhelin

# lightEntrepreneurTaxNo
source: Light Entrepreneur Tax Number
et: Kerge ettevõtja maksunumber
fi: Kevyt yrittäjän veronumero

source: Light Entrepreneur Billing Address
et: Kerge ettevõtja arveldusaadress
fi: Kevyt yrittäjän laskutusosoite

source: Invoicing Email
et: Arve esitamise e-post
fi: Laskutusosoite

source: Worksite Address
et: Töökoha aadress
fi: Työpaikan osoite

source: Reference Number
et: Viitenumber
fi: Viitenumero

source: Beginning of work
et: Töö algus
fi: Työn alku

source: Work Finished On
et: Töö on lõpetatud
fi: Työ valmis

source: Billing Interval
et: Arvelduse intervall
fi: Laskutusväli

source: Other Information
et: Muu info
fi: Muita tietoja

source: Invoicing by
et: Arve esitanud
fi: Laskutus:

# employerSignatute
source: Employer Signature
et: Tööandja allkiri
fi: Työnantajan allekirjoitus

source: Light Entrepreneur Signature
et: Kerge ettevõtja allkiri
fi: Kevyen yrittäjän allekirjoitus

source: Food Type
et: Toidu tüüp
fi: Ruokatyyppi

source: Food Value
et: Toidu väärtus
fi: Ruoka-arvo

source: Travelling Type
et: Reisiv tüüp
fi: Matkustustyyppi

source: Travelling Value
et: Reisiväärtus
fi: Matka-arvo

source: Accepted by light entrepreneur
et: Aktsepteerib kerge ettevõtja
fi: Kevyen yrittäjän hyväksymä

source: Contract by file
et: Lepingu koopia
fi: Kopio sopimuksesta

source: My Contract
et: Minu leping
fi: Minun sopimus

source: Contract Name
et: Lepingu nimi
fi: Sopimuksen nimi

# myDocument
source: Documents
et: Dokumendid
fi: Asiakirjat

source: Warning ! You must add document like
et: Hoiatus! Peate lisama dokumendi nagu
fi: Varoitus ! Lisää dokumentti kuten

source: E-Contract
et: E-leping
fi: Sähköinen sopimus

source: Download
et: Lae alla
fi: ladata

source: Document Expired
et: Dokument on aegunud
fi: Asiakirja on vanhentunut

source: Document Not Expired
et: Dokument ei ole aegunud
fi: Asiakirja ei ole vanhentunut

source: Accept
et: Nõustun
fi: Hyväksyn

source: Agree
et: Nõustun
fi: Hyväksyn

source: Pending
et: Ootel
fi: Odottaa

source: Days
et: Päeva
fi: Pv

source: Approved
et: Heaks kiidetud
fi: Hyväksytty

source: Not paid
et: Maksmata
fi: Maksamatta

source: Paid
et: Makstud
fi: Maksettu

source: SSN
et: Isikukood
fi: Henkilötunnus

source: No Employee Found
et: Töötajat ei leitud
fi: Työntekijää ei löytynyt

source: Contract Of
et: Leping
fi: Sopimus

source: Select
et: Valige
fi: Valitse

source: VAT
et: Käibemaks
fi: Arvonlisävero

source: Brutto Salary
et: Brutto palk
fi: Brutto Palkka

source: Bulk Amount
et: Hulgikogus
fi: Bulk määrä

source: Earned so far
et: Seni teenitud
fi: Ansaittu tähän mennessä

source: Please select gender
et: Valige sugu
fi: Valitse sukupuoli

source: Enter valid current address
et: Sisestage kehtiv praegune aadresss
fi: Anna kelvollinen nykyinen katuosoite

source: Please select country
et: Valige riik
fi: Valitse maa

source: Enter valid city
et: Sisestage kehtiv linn
fi: Anna kelvollinen kaupunki

source: Forgot Password
et: Unustasid parooli
fi: Unohtuiko salasana

source: First Name
et: Eesnimi
fi: Etunimi

source: Last Name
et: Perekonnanimi
fi: Sukunimi

source: Enter valid first name
et: Sisestage kehtiv eesnimi
fi: Anna kelvollinen etunimi

source: Enter valid last name
et: Sisestage kehtiv perekonnanimi
fi: Anna kelvollinen sukunimi

source: Enter Last Name
et: Sisestage perekonnanimi
fi: Syötä sukunimi

source: Enter First Name
et: Sisestage eesnimi
fi: Syötä etunimi
